DroneBridge/ESP32/main/db_esp_now.c
    }
    return false;
}

/**
 * Add a new ESP-NOW broadcast peer to the list of known ESP-NOW peers. Checks if peer is already known based on MAC.
 * List is then used to keep track of the RSSI, packet loss and signal quality on GND side.
 *
 * @param esp_now_clients List of broadcast peers (ESP-NOW) with their RSSI
 * @param broadcast_peer_mac MAC address of a potentially new broadcast peer
 * @return index of the peer inside the list or -1 in case of error e.g. if list is full or not initialized
 */
int16_t update_peer_list(db_esp_now_clients_list_t *esp_now_clients, uint8_t broadcast_peer_mac[6]) {
    if (esp_now_clients == NULL) { // Check if the list is NULL
        return -1; // Do nothing
    }
    for (uint8_t i = 0; i < esp_now_clients->size; i++) {
        if (memcmp(esp_now_clients->db_esp_now_bpeer_info[i].broadcast_peer_mac, broadcast_peer_mac, ESP_NOW_ETH_ALEN) == 0) {
            // found the client - he is already part of the known clients list
            return i;
        }
    }
    if (esp_now_clients->size == DB_ESPNOW_MAX_BROADCAST_PEERS) { // Check if the list is full
        return -1; // Do nothing - list is full already
    } else {
        // Add new peer to list - Copy the element data to the end of the array
        db_esp_now_bpeer_info_t db_esp_now_bpeer_info = {.gnd_rssi = -127, .last_seq_num = 0, .gnd_rx_lost_packets = 0};
        memcpy(db_esp_now_bpeer_info.broadcast_peer_mac, broadcast_peer_mac, ESP_NOW_ETH_ALEN);
        esp_now_clients->db_esp_now_bpeer_info[esp_now_clients->size] = db_esp_now_bpeer_info;
        esp_now_clients->size++; // Increment the size of the list
        return (esp_now_clients->size-1) ;
    }
}

/**
 * Steps to process received ESPNOW data. ESP firmware ensures that only correct packets are forwarded to us
 * 1. Decrypt & authenticate
 * 2. Check if we know the client based on MAC - update rssi in case we are GND - AIR side only expects to only ever have on GND peer anyways
 * 3. Check sequence number and if we are GND station then update lost packet count based on seq. numbers
 * 4. Write payload to uart-queue so it can be processed by the control_espnow task
 *
 * @param data Received raw data via ESP-NOW
 * @param data_len  Length of received data
 * @param src_addr Source MAC address of the data
 * @param rssi RSSI in dBm of this packet
 * @param noise_floor Noise floor in dBm measured while receiving this packet
 */
void db_espnow_process_rcv_data(uint8_t *data, uint16_t data_len, uint8_t *src_addr, int8_t rssi, int8_t noise_floor) {
    const uint16_t minimum_packet_length = db_esp_now_packet_header_len + DB_ESPNOW_AES_TAG_LEN + 1U;
    if (data == NULL || src_addr == NULL || data_len < minimum_packet_length) {
        ESP_LOGW(TAG, "Ignoring malformed ESP-NOW packet of length %u", data_len);
        return;
    }
    db_esp_now_packet_t *db_esp_now_packet = (db_esp_now_packet_t *) data;
    const uint16_t protected_data_length = data_len - DB_ESPNOW_AES_TAG_LEN - db_esp_now_packet_header_len;
    if (protected_data_length > DB_ESPNOW_PAYLOAD_MAXSIZE + 1U) {
        ESP_LOGW(TAG, "Ignoring oversized ESP-NOW protected payload of length %u", protected_data_length);
        return;
    }
    const uint8_t len_payload = (uint8_t) protected_data_length;
    uint8_t db_decrypted_data[len_payload];

    /* Decrypt and authenticate packet - only then process its contents */
    if (db_decrypt_payload(db_esp_now_packet, db_decrypted_data, len_payload) == 0) {
        const uint8_t origin = db_esp_now_packet->db_esp_now_packet_header.origin;
        if (!db_espnow_origin_is_allowed(origin)) {
            ESP_LOGW(TAG, "Ignoring authenticated ESP-NOW packet with disallowed origin %u", origin);
            return;
        }
        if (db_decrypted_data[0] != len_payload - 1U) {
            ESP_LOGW(TAG, "Ignoring ESP-NOW packet with inconsistent decrypted payload length");
            return;
        }

        /* Check if we know that peer already */
        if (DB_PARAM_RADIO_MODE == DB_WIFI_MODE_ESPNOW_GND && origin == DB_ESPNOW_ORIGIN_AIR) {
            db_esp_now_clients_list->gnd_noise_floor = noise_floor;
            int16_t peer_index = update_peer_list(db_esp_now_clients_list, src_addr);
            if (peer_index != -1) {
                // Update the list with RSSI and packet loss only on the GND side.
                db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].gnd_rssi = rssi;
            // check packet sequence number
                if (db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].last_seq_num < db_esp_now_packet->db_esp_now_packet_header.seq_num) {
                // Count the lost packets per peer since the last received packet
                    db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].gnd_rx_lost_packets +=
                        (db_esp_now_packet->db_esp_now_packet_header.seq_num -
                        db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].last_seq_num - 1);
                } else {
                    ESP_LOGW(TAG, "Sequence number lower than expected. Sender did reset or packet may be part of a replay attack.");
                // accept packet anyway for now to make for a more robust link
                    db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].gnd_rx_lost_packets = 0;
                }

                db_esp_now_clients_list->db_esp_now_bpeer_info[peer_index].last_seq_num = db_esp_now_packet->db_esp_now_packet_header.seq_num;
            }
        } else if (DB_PARAM_RADIO_MODE == DB_WIFI_MODE_ESPNOW_AIR && origin == DB_ESPNOW_ORIGIN_GND) {
            // AIR link quality must describe the GND link, never a neighbouring AIR peer.
            db_esp_signal_quality.air_rssi = rssi;
            db_esp_signal_quality.air_noise_floor = noise_floor;
        }

        /* Process packet depending on packet type */
        if (db_esp_now_packet->db_esp_now_packet_header.packet_type == DB_ESP_NOW_PACKET_TYPE_DATA) {
            // Pass data to UART queue
            db_espnow_uart_queue_event_t db_uart_evt = {0};
            db_uart_evt.data_len = db_decrypted_data[0];    // should be equal to len_payload-1 if everything worked out
            db_uart_evt.data = malloc(db_uart_evt.data_len);
            // For some reason it seems we cannot directly decrypt to db_espnow_uart_event_t -> Queues get set to NULL
            memcpy(db_uart_evt.data, &db_decrypted_data[1], db_uart_evt.data_len);
            memcpy(db_uart_evt.source_mac, src_addr, ESP_NOW_ETH_ALEN);
            db_uart_evt.seq_num = db_esp_now_packet->db_esp_now_packet_header.seq_num;
            db_uart_evt.origin = origin;
            if (xQueueSend(db_uart_write_queue, &db_uart_evt, ESPNOW_MAXDELAY) != pdTRUE) {
                ESP_LOGW(TAG, "Send to db_uart_write_queue failed");
                free(db_uart_evt.data);
            } else {
                // all good
            }
        } else if (db_esp_now_packet->db_esp_now_packet_header.packet_type == DB_ESP_NOW_PACKET_TYPE_INTERNAL_TELEMETRY &&
                   DB_PARAM_RADIO_MODE == DB_WIFI_MODE_ESPNOW_AIR && origin == DB_ESPNOW_ORIGIN_GND) {
            /* This is only called on the AIR side since GND sends telemetry to AIR only */
            if (db_decrypted_data[0] != sizeof(db_esp_now_clients_list_t)) {
                ESP_LOGW(TAG, "Ignoring ESP-NOW internal telemetry with unexpected payload length");
                return;
            }
            db_esp_now_clients_list_t *clients = (db_esp_now_clients_list_t*) &db_decrypted_data[1];
            ESP_LOGD(TAG, "Received internal telemetry frame containing %i entries", clients->size);
            for (int i = 0; i < clients->size; i++) {
                if (memcmp(LOCAL_MAC_ADDRESS, clients->db_esp_now_bpeer_info[i].broadcast_peer_mac, ESP_NOW_ETH_ALEN) == 0) {
                    // found us (this local ESP32 AIR unit) -> update internal telemetry buffer,
                    // so it gets sent with next Mavlink RADIO STATUS in case MAVLink radio status is enabled
                    db_esp_signal_quality.gnd_noise_floor = clients->gnd_noise_floor;
                    db_esp_signal_quality.gnd_rssi = clients->db_esp_now_bpeer_info[i].gnd_rssi;
                    db_esp_signal_quality.gnd_rx_packets_lost = clients->db_esp_now_bpeer_info[i].gnd_rx_lost_packets;
                    break;
                } else {
                    // keep on looking for our MAC
                }
            }
        } else {
            ESP_LOGW(TAG, "Received unknown DroneBridge for ESP32 ESP-NOW packet type");
        }
    } else {
        ESP_LOGE(TAG, "Failed to Decrypt & Authenticate. Ignoring");
        return;
    }
}

/**
 * ESP-NOW sending callback function is called in WiFi task.
 * Do not do lengthy operations from this task. Instead, post necessary data to a queue and handle it from the control
 * module task.
 * Note that too short interval between sending two ESP-NOW data may lead to disorder of sending callback function.
 * So, it is recommended that sending the next ESP-NOW data after the sending callback function of the previous sending
 * has returned.
 */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
static void db_espnow_send_callback(const esp_now_send_info_t *esp_now_send_info, esp_now_send_status_t status) {
    if (status == ESP_NOW_SEND_FAIL) {
        ESP_LOGE(TAG, "Failed to send ESP-NOW packet - MAC: %02xh:%02xh:%02xh:%02xh:%02xh:%02xh",
                 esp_now_send_info->des_addr[0], esp_now_send_info->des_addr[1], esp_now_send_info->des_addr[2], esp_now_send_info->des_addr[3], esp_now_send_info->des_addr[4], esp_now_send_info->des_addr[5]);
    }
#else
static void db_espnow_send_callback(const uint8_t *mac_addr, esp_now_send_status_t status) {
    if (mac_addr == NULL) {
        ESP_LOGE(TAG, "Send callback arg error");
        return;
    }

    if (status == ESP_NOW_SEND_FAIL) {
        ESP_LOGE(TAG, "Failed to send ESP-NOW packet - MAC: %02xh:%02xh:%02xh:%02xh:%02xh:%02xh",
                 mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
    }
#endif

    db_espnow_event_t evt;
    db_espnow_event_send_cb_t *send_cb = &evt.info.send_cb;

    evt.id = DB_ESPNOW_SEND_CB;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
    memcpy(send_cb->mac_addr, esp_now_send_info->des_addr, ESP_NOW_ETH_ALEN);
#else
    memcpy(send_cb->mac_addr, mac_addr, ESP_NOW_ETH_ALEN);
#endif
    send_cb->status = status;
    if (xQueueSend(db_espnow_send_recv_callback_queue, &evt, ESPNOW_MAXDELAY) != pdTRUE) {
        ESP_LOGW(TAG, "Send to send queue fail");
    }
}

/**
 * ESP-NOW receiving callback function is called in WiFi task. This is the entry point when new data is incoming.
 * Do not do lengthy operations from this task. Instead, post necessary data to a queue and handle it from the control
 * module task
 */
static void db_espnow_receive_callback(const esp_now_recv_info_t *recv_info, const uint8_t *data, int len) {
    db_espnow_event_t evt;
    db_espnow_event_recv_cb_t *recv_cb = &evt.info.recv_cb;
    const uint16_t minimum_packet_length = db_esp_now_packet_header_len + DB_ESPNOW_AES_TAG_LEN + 1U;

    if (recv_info == NULL || data == NULL || len < minimum_packet_length) {
        ESP_LOGE(TAG, "Receive callback arg error");
        return;
    }
    uint8_t *src_addr = recv_info->src_addr;
    uint8_t *des_addr = recv_info->des_addr;
    if (src_addr == NULL || des_addr == NULL) {
        ESP_LOGE(TAG, "Receive callback address error");
        return;
    }

