DroneBridge/ESP32/main/db_esp_now.c
    if (!IS_BROADCAST_ADDR(des_addr)) {
        ESP_LOGD(TAG, "Receive uni-cast ESP-NOW data. Ignoring");
        return;
    }

    // The header is authenticated later. This early rejection only avoids allocating and queueing known-disallowed traffic.
    if (!db_espnow_origin_is_allowed(data[0])) {
        ESP_LOGD(TAG, "Receive ESP-NOW data with disallowed origin. Ignoring");
        return;
    }

    evt.id = DB_ESPNOW_RECV_CB;
    memcpy(recv_cb->mac_addr, src_addr, ESP_NOW_ETH_ALEN);
    recv_cb->data = malloc(len);
    if (recv_cb->data == NULL) {
        ESP_LOGE(TAG, "Malloc receive data fail");
        return;
    }
    memcpy(recv_cb->data, data, len);
    recv_cb->data_len = len;
    recv_cb->rssi = recv_info->rx_ctrl == NULL ? -127 : recv_info->rx_ctrl->rssi;
    recv_cb->noise_floor = 0;
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32C6)
    if (recv_info->rx_ctrl != NULL) {
        recv_cb->noise_floor = recv_info->rx_ctrl->noise_floor;
    }
#endif
    if (db_espnow_send_recv_callback_queue != NULL && xQueueSend(db_espnow_send_recv_callback_queue, &evt, ESPNOW_MAXDELAY) != pdTRUE) {
        ESP_LOGW(TAG, "Send to receive queue fail");
        free(recv_cb->data);
    }
}

/**
 *  Init/Create structure containing all ESP-NOW broadcast connection quality information
 *  List is used to keep track of the RSSI and signal quality on GND side.
 * @return Structure containing all ESP-NOW broadcast connection quality information
 */
db_esp_now_clients_list_t *db_espnow_broadcast_peers_list_create() {
    db_esp_now_clients_list_t *client_list = malloc(sizeof(db_esp_now_clients_list_t)); // Allocate memory for the list
    if (client_list == NULL) { // Check if the allocation failed
        return NULL; // Return NULL to indicate an error
    }
    client_list->size = 0; // Initialize the size to 0
    return client_list; // Return the pointer to the list
}

/**
 * Destroy structure containing all ESP-NOW broadcast connection quality information
 * @param db_esp_now_clients Structure containing all ESP-NOW broadcast connection quality information
 */
void db_espnow_broadcast_peers_list_destroy(db_esp_now_clients_list_t *esp_now_clients) {
    if (esp_now_clients == NULL) { // Check if the list is NULL
        return; // Do nothing
    }
    free(esp_now_clients); // Free the list
}

/**
 * Init mbedtls aes gcm mode and set encryption key based on the WiFi password specified by the user
 * @param aes_key buffer for saving the generated aes key of len AES_256_KEY_BYTES
 * @return result of mbedtls_gcm_setkey
 */
int init_gcm_encryption_module(uint8_t *aes_key) {
    mbedtls_gcm_init(&aes);
    const char *espnow_secret = strlen(DB_PARAM_ESPNOW_LINK_SECRET) > 0 ? DB_PARAM_ESPNOW_LINK_SECRET : DB_PARAM_PASS;
    generate_pkcs5_key(espnow_secret, aes_key, AES_256_KEY_BYTES);
    int ret = mbedtls_gcm_setkey(&aes, MBEDTLS_CIPHER_ID_AES, aes_key, DB_ESPNOW_AES_KEY_LEN);
    return ret;
}

void deinit_espnow_all(){
    ESP_LOGW(TAG, "De init ESPNOW incl. Queues & AES");
    mbedtls_gcm_free(&aes);
    vSemaphoreDelete(db_espnow_send_recv_callback_queue);
    vSemaphoreDelete(db_espnow_send_queue); // ToDo: Check if that is a good idea since control task might be using it
    vSemaphoreDelete(db_uart_write_queue); // ToDo: Check if that is a good idea since control task might be using it
    db_espnow_broadcast_peers_list_destroy(db_esp_now_clients_list);
    esp_now_deinit();
}

/**
 * Init all relevant structures and Queues for ESP-NOW communication
 * @return ESP_FAIL on failure or ESP_OK on success
 */
esp_err_t db_espnow_init() {
    ESP_LOGI(TAG, "Initializing ESP-NOW parameters");
    db_esp_now_clients_list = db_espnow_broadcast_peers_list_create();
    /* Init Queue for ESP-NOW internal callbacks when packet is finally sent or received */
    db_espnow_send_recv_callback_queue = xQueueCreate(ESPNOW_QUEUE_SIZE, sizeof(db_espnow_event_t));
    if (db_espnow_send_recv_callback_queue == NULL) {
        ESP_LOGE(TAG, "Create db_espnow_send_recv_callback_queue mutex fail");
        return ESP_FAIL;
    }

    /* Init Queues for communication with control task */
    db_espnow_send_queue = xQueueCreate(ESPNOW_QUEUE_SIZE, sizeof(db_espnow_queue_event_t));
    db_uart_write_queue = xQueueCreate(ESPNOW_QUEUE_SIZE, sizeof(db_espnow_uart_queue_event_t));
    if (db_espnow_send_queue == NULL) {
        ESP_LOGE(TAG, "Create db_espnow_send_queue mutex fail");
        return ESP_FAIL;
    }
    if (db_uart_write_queue == NULL) {
        ESP_LOGE(TAG, "Create db_uart_write_queue mutex fail");
        return ESP_FAIL;
    }

    /* Initialize ESP-NOW and register sending and receiving callback function. */
    ESP_ERROR_CHECK(esp_now_init());
    ESP_ERROR_CHECK(esp_now_register_send_cb(db_espnow_send_callback));
    ESP_ERROR_CHECK(esp_now_register_recv_cb(db_espnow_receive_callback));

    /* Add broadcast peer information to peer list. */
    esp_now_peer_info_t peer = {0};
    memcpy(peer.peer_addr, BROADCAST_MAC, 6);
    if (!esp_now_is_peer_exist(BROADCAST_MAC)) ESP_ERROR_CHECK(esp_now_add_peer(&peer));

    /* Limit payload size to the max we can do */
    if (DB_PARAM_SERIAL_PACK_SIZE > DB_ESPNOW_PAYLOAD_MAXSIZE || DB_PARAM_SERIAL_PACK_SIZE < 1) {
        DB_PARAM_SERIAL_PACK_SIZE = DB_ESPNOW_PAYLOAD_MAXSIZE;
    } else {
        // all good
    }

    /* Init AES GCM encryption module */
    uint8_t aes_key[AES_256_KEY_BYTES];
    int ret = init_gcm_encryption_module(aes_key);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_gcm_setkey returned an error: %i", ret);
        deinit_espnow_all();
        return ESP_FAIL;
    }
    ESP_ERROR_CHECK(esp_now_set_pmk(aes_key));  // only first 16 bytes will be used

    if (DB_PARAM_RADIO_MODE == DB_WIFI_MODE_ESPNOW_GND) {
        ESP_LOGI(TAG, "ESP-NOW for DroneBridge init done - acting as ESP-NOW GND station");
    } else {
        ESP_LOGI(TAG, "ESP-NOW for DroneBridge init done - acting as ESP-NOW AIR station");
    }
    return ESP_OK;
}

/**
 * Send ESP-NOW DroneBridge for ESP32 internal telemetry packet containing RSSI and noise floor info from GND to AIR.
 * Used by AIR side to create a RADIO_STATUS MAVLink message sent to GCS.
 * @return true when packet was scheduled for sending, false if it will not be sent
 */
bool db_espnow_schedule_internal_telemetry_packet() {
    if (DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND) {
        // Only GND sends internal telemetry. This function was called wrongly
        return false;
    } else {
        // continue
    }
    // ToDo: Split list if longer than max payload size
    if (sizeof(db_esp_now_clients_list_t) > DB_ESPNOW_PAYLOAD_MAXSIZE) {
        ESP_LOGE(TAG, "Size of db_esp_now_clients_list_t is > %i", DB_ESPNOW_PAYLOAD_MAXSIZE);
        return false;
    } else {
        /* continue */
    }
    ESP_LOGD(TAG, "Scheduling int. telem. packet");
    uint8_t payload_size = sizeof(db_esp_now_clients_list_t);

    db_espnow_queue_event_t evt;
    // Set payload of DroneBridge for ESP32 ESP-NOW packet
    evt.data = malloc(payload_size);
    memcpy(evt.data, db_esp_now_clients_list, payload_size);
    evt.data_len = payload_size;
    evt.packet_type = DB_ESP_NOW_PACKET_TYPE_INTERNAL_TELEMETRY;
    if (xQueueSend(db_espnow_send_queue, &evt, ESPNOW_MAXDELAY) != pdTRUE) {
        ESP_LOGW(TAG, "Send to db_espnow_send_queue queue fail");
        free(evt.data);
        return false;
    } else {
        // all good
        return true;
    }
}

/**
 *  Task that handles all ESP-NOW related data processing. Reads ESP-NOW Callback-Queue, Reads ESP-NOW send queue and
 *  writes to UART-WRITE Queue.
 */
_Noreturn void process_espnow_data() {
    esp_err_t err = db_espnow_init();
    if (err == ESP_OK) {
        // all good. continue
    } else {
        ESP_LOGE(TAG, "Failed to init espnow (db_espnow_init()) aborting start of db_espnow task");
        vTaskDelete(NULL);
    }
    db_espnow_event_t evt;
    // indicator that the last ESP-NOW send callback returned -> we can send the next packet
    bool ready_to_send = true; // initially true
    bool send_internal_telemetry_frame = false;    // flag that indicates a new internal telemetry frame shall be sent
    int delay_timer_cnt = 0;
    while(1) {
        if (db_espnow_send_recv_callback_queue == NULL) ESP_LOGE(TAG, "db_espnow_send_recv_callback_queue is NULL!");
        if(db_espnow_send_recv_callback_queue != NULL && xQueueReceive(db_espnow_send_recv_callback_queue, &evt, 0) == pdTRUE) {
            switch (evt.id) {
                case DB_ESPNOW_SEND_CB: {
                    // db_espnow_event_send_cb_t *send_cb = &evt.info.send_cb;  // no needed for now
                    // indicate that we can send next packet - the last sending callback has returned, so we keep the order
                    // of packets. ESP-NOW by default does not guarantee the order when many packets are sent in quick succession
                    ready_to_send = true;
                    if (DB_PARAM_RADIO_MODE == DB_WIFI_MODE_ESPNOW_GND && send_internal_telemetry_frame) {
                        send_internal_telemetry_frame = !db_espnow_schedule_internal_telemetry_packet();
                    } else {
                        // try to immediately send the next packet if available and set ready_to_send accordingly
                        ready_to_send = !db_read_uart_queue_and_send();
                    }
                    break;
                }
                case DB_ESPNOW_RECV_CB: {
                    db_espnow_event_recv_cb_t *recv_cb = &evt.info.recv_cb;
                    db_espnow_process_rcv_data(recv_cb->data, recv_cb->data_len, recv_cb->mac_addr, recv_cb->rssi,
                                                recv_cb->noise_floor);
                    free(recv_cb->data);
                    break;
                }
                default:
                    ESP_LOGE(TAG, "Callback type error: %d", evt.id);
                    break;
            }
        }
        /* process UART -> ESP-NOW */
        if (ready_to_send) {
            // send the next packet if available and set ready_to_send accordingly
            ready_to_send = !db_read_uart_queue_and_send();
        } else {
            // do nothing - we are not ready for sending another packet
        }

        if (delay_timer_cnt == 5000) {
            /* all actions are non-blocking so allow some delay so that the IDLE task of FreeRTOS and the watchdog can run
            read: https://esp32developer.com/programming-in-c-c/tasks/tasks-vs-co-routines for reference */
            vTaskDelay(10 / portTICK_PERIOD_MS);
            send_internal_telemetry_frame = true;   // use this timer trigger to schedule a new internal telemetry frame
            delay_timer_cnt = 0;
        } else {
            delay_timer_cnt++;
        }
    }
    vTaskDelete(NULL);
}

/**
 * Start task that handles ESP-NOW data
 */
void db_start_espnow_module() {
    xTaskCreate(&process_espnow_data, "db_espnow", 40960, NULL, 5, NULL);
}
